Repository: OguzAytar/kumbara
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Kumbara - Savings Tracker
tr: Kumbara - Birikim Takip

source: Welcome
tr: Hoş Geldiniz

source: Get Started
tr: Başlayalım

# onboardingTitle1
source: Set Your Goals
tr: Hedeflerinizi Belirleyin

# onboardingDesc1
source: Easily create and track your savings goals
tr: Birikim hedeflerinizi kolayca oluşturun ve takip edin

# onboardingTitle2
source: Save Money
tr: Para Biriktirin

# onboardingDesc2
source: Regularly deposit money and reach your goals
tr: Düzenli olarak para yatırın ve hedeflerinize ulaşın

# onboardingTitle3
source: Track Your Progress
tr: İlerlemenizi İzleyin

# onboardingDesc3
source: Visualize your progress with charts and reports
tr: Grafikler ve raporlarla ilerlemenizi görselleştirin

source: Next
tr: İleri

source: Skip
tr: Geç

source: Home
tr: Ana Sayfa

source: Total Savings
tr: Toplam Birikimler

source: Active Goals
tr: Aktif Hedefler

source: Completed Goals
tr: Tamamlanan Hedefler

source: Recent Savings
tr: Son Birikimler

source: Add Saving
tr: Birikim Ekle

source: Settings
tr: Ayarlar

source: General
tr: Genel

source: Notifications
tr: Bildirimler

# notificationSubtitle
source: Reminder notifications
tr: Hatırlatma bildirimleri

source: Theme
tr: Tema

source: Light theme
tr: Açık tema

source: Dark theme
tr: Karanlık tema

source: Language
tr: Dil

source: Data
tr: Veriler

source: Backup Data
tr: Verileri Yedekle

# backupSubtitle
source: Backup your savings
tr: Birikimlerinizi yedekleyin

source: Restore Data
tr: Verileri Geri Yükle

# restoreSubtitle
source: Restore from backup
tr: Yedekten geri yükleyin

source: Delete All Data
tr: Tüm Verileri Sil

# deleteDataSubtitle
source: Warning: This action cannot be undone
tr: Dikkat: Bu işlem geri alınamaz

source: About
tr: Hakkında

source: Version
tr: Sürüm

source: Help & Support
tr: Yardım & Destek

# helpSubtitle
source: FAQ and contact
tr: SSS ve iletişim

source: Select Theme
tr: Tema Seçin

source: Select Language
tr: Dil Seçin

source: Cancel
tr: İptal

source: Delete
tr: Sil

# deleteAllDataTitle
source: Delete All Data
tr: Tüm Verileri Sil

# deleteAllDataMessage
source: This action will delete all your savings and settings. This action cannot be undone. Are you sure you want to continue?
tr: Bu işlem tüm birikimlerinizi ve ayarlarınızı silecektir. Bu işlem geri alınamaz. Devam etmek istediğinizden emin misiniz?

source: Data backed up successfully!
tr: Veriler başarıyla yedeklendi!

source: Data restored successfully!
tr: Veriler başarıyla geri yüklendi!

# dataDeletedSuccessfully
source: All data deleted successfully!
tr: Tüm veriler başarıyla silindi!

# backupError
source: Error during backup: {error}
tr: Yedekleme sırasında hata oluştu: {error}

# restoreError
source: Error during restore: {error}
tr: Geri yükleme sırasında hata oluştu: {error}

# deleteError
source: Error during data deletion: {error}
tr: Veri silme sırasında hata oluştu: {error}

# helpComingSoon
source: Help page coming soon!
tr: Yardım sayfası yakında eklenecek!

# retry
source: Try Again
tr: Tekrar Dene

# newSavingComingSoon
source: Add new saving feature coming soon!
tr: Yeni birikim ekleme özelliği yakında eklenecek!

# welcomeMessage
source: Welcome! 👋
tr: Hoş Geldiniz! 👋

# welcomeSubtitle
source: Get one step closer to your dreams
tr: Hayallerinize bir adım daha yaklaşın

source: Nearest Target
tr: En Yakın Hedef

source: Most Progress
tr: En Çok İlerleme

source: My Savings
tr: Birikimlerim

source: See All
tr: Tümünü Gör

# allSavingsComingSoon
source: All savings page coming soon!
tr: Tüm birikimler sayfası yakında eklenecek!

source: Target not found
tr: Hedef bulunamadı

source: Expired
tr: Süresi dolmuş

# oneDayLeft
source: 1 day left
tr: 1 gün kaldı

# daysLeft
source: {days} days left
tr: {days} gün kaldı

source: Saving not found
tr: Birikim bulunamadı

source: Summary Statistics
tr: Özet İstatistikler

source: Total Saving
tr: Toplam Birikim

source: Active Target
tr: Aktif Hedef

source: Total Amount
tr: Toplam Miktar

# noSavingsGoal
source: No savings goal yet
tr: Henüz birikim hedefi yok

# createFirstGoal
source: Click the + button to create your first savings goal
tr: İlk birikim hedefinizi oluşturmak için + butonuna tıklayın

# detailPageComingSoon
source: {title} detail page coming soon!
tr: {title} detay sayfası yakında eklenecek!

source: Track Your Savings
tr: Birikimlerinizi Takip Edin

# trackYourSavingsDesc
source: Easily track and manage your savings to reach your goals.
tr: Hedeflerinize ulaşmak için biriktirmelerinizi kolayca takip edin ve yönetin.

source: See Your Progress
tr: İlerlemenizi Görün

# seeYourProgressDesc
source: Analyze your savings progress in detail with charts and reports.
tr: Grafikler ve raporlarla birikimleririnizin ilerleyişini detaylı bir şekilde analiz edin.

source: Get Reminders
tr: Hatırlatmalar Alın

# getRemindersDesc
source: Use notifications to remember to save regularly.
tr: Düzenli birikim yapmayı unutmamak için bildirimlerden yararlanın.

source: Back
tr: Geri

# continueButton
source: Continue
tr: Devam Et

source: Allow Notifications
tr: Bildirimlere İzin Ver

source: Continue Without Notifications
tr: Bildirimsiz Devam Et

# notificationPermissionGranted
source: Notification permission granted! You can now receive reminders.
tr: Bildirim izni verildi! Artık hatırlatmalar alabilirsiniz.

# notificationPermissionDenied
source: Notification permission denied. You can enable it in settings.
tr: Bildirim izni reddedildi. Ayarlardan açabilirsiniz.

# notificationPermissionError
source: Error occurred while requesting notification permission: {error}
tr: Bildirim izni alınırken hata oluştu: {error}

# notificationChannelName
source: Kumbara Notifications
tr: Kumbara Bildirimleri

# notificationChannelDescription
source: Savings reminders and goal notifications
tr: Birikim hatırlatmaları ve hedef bildirimleri

# savingReminderTitle
source: Time to Save!
tr: Birikim Zamanı!

# savingReminderBody
source: Don't forget to save money today to get one step closer to your goals
tr: Hedeflerinize bir adım daha yaklaşmak için bugün para yatırmayı unutmayın

# goalAchievedTitle
source: Congratulations! 🎉
tr: Tebrikler! 🎉

# goalAchievedBody
source: You've reached your goal! You can set a new goal
tr: Hedefinize ulaştınız! Yeni bir hedef belirleyebilirsiniz

# goalNearlyAchievedTitle
source: You're Almost There!
tr: Hedefinize Çok Yakınsınız!

# goalNearlyAchievedBody
source: You've reached 90% of your goal. Final sprint!
tr: Hedefinizin %90'ına ulaştınız. Son spurt!

source: Add New Saving
tr: Yeni Birikim Ekle

source: Save
tr: Kaydet

source: Saving Name
tr: Birikim Adı

# savingNameHint
source: e.g. Holiday Fund, New Car
tr: Örn: Tatil Fonu, Yeni Araba

source: Please enter saving name
tr: Lütfen birikim adını giriniz

source: Description
tr: Açıklama

# descriptionHint
source: Write your notes about this saving...
tr: Bu birikim hakkında notlarınızı yazın...

source: Target Amount
tr: Hedef Tutar

source: Set target amount
tr: Hedef tutar belirle

# setTargetAmountDesc
source: Set the amount you want to reach
tr: Ulaşmak istediğiniz tutarı belirleyin

# targetAmountHint
source: e.g. 5000
tr: Örn: 5000

source: Please enter target amount
tr: Lütfen hedef tutarını giriniz

# pleaseEnterValidAmount
source: Please enter a valid amount
tr: Lütfen geçerli bir tutar giriniz

source: Target Date
tr: Hedef Tarihi

source: Set target date
tr: Hedef tarih belirle

# setTargetDateDesc
source: Set the date you want to reach your goal
tr: Hedefinize ulaşmak istediğiniz tarihi belirleyin

source: Select target date
tr: Hedef tarihi seçiniz

source: Please select target date
tr: Lütfen hedef tarihini seçiniz

# savingInfo
source: If you don't set a target amount or date, your saving will work like a piggy bank and only track how much money you save.
tr: Hedef tutar veya tarih belirlemezseniz, birikiminiz kumbara gibi çalışır ve sadece ne kadar para biriktirdiğinizi takip eder.

source: Saving added successfully!
tr: Birikim başarıyla eklendi!

# errorAddingSaving
source: Error occurred while adding saving
tr: Birikim eklenirken hata oluştu

# sortByNewest
source: Newest
tr: En Yeniler

# sortByOldest
source: Oldest
tr: En Eskiler

# sortByProgress
source: Progress
tr: İlerleme Durumu

# sortByAmount
source: Amount
tr: Tutar

source: All Savings
tr: Tüm Birikimler

source: Active Savings
tr: Aktif Birikimler

source: Completed Savings
tr: Tamamlanan Birikimler

source: Paused Savings
tr: Duraklatılan Birikimler

# searchSavings
source: Search your savings...
tr: Birikimlerinizi arayın...

source: Saving detail coming soon
tr: Birikim detayı yakında gelecek

source: Savings Overview
tr: Birikimlerim Özeti

# totalSavingsCount
source: {count} savings
tr: {count} adet birikim

source: Total Target
tr: Toplam Hedef

source: Average Progress
tr: Ortalama İlerleme

source: No savings found
tr: Birikim bulunamadı

# noSavingsFoundDesc
source: You haven't added any savings yet or there are no savings matching your search criteria.
tr: Henüz hiç birikim eklememişsiniz veya arama kriterlerinize uygun birikim yok.

source: completed
tr: tamamlandı
